Catalogs/ЧастичнаяОтгрузка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЧастичнаяОтгрузка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредметыОтгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредметОтгрузки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омСклад/Ext/Module.bsl
Функция ПолучитьОтчетПоЧастичнойОтгрузкеHTML(ИзделиеКомплект) Экспорт
	 
	 стрВозврата = омHTML.ПолучитьЗаголовокHTML();
	 
	 стрВозврата = стрВозврата + омHTML.ПолучитьHeadHTML(Строка(ИзделиеКомплект), 1);
	 
	 стрВозврата = стрВозврата + "<table>";
	 стрВозврата = стрВозврата + "<tr><td>Дата</td><td>Отгрузка</td><td>Автор</td></tr>";
	 
	 ШаблонСтроки = "<tr><td>%1</td><td>%2</td><td>%3</td></tr>";
	 
	 Для каждого СтрокаТаблицы Из ПолучитьЧастичныеОтгрузки(ИзделиеКомплект) Цикл
		 стрВозврата = стрВозврата + СтрШаблон(ШаблонСтроки, Формат(СтрокаТаблицы.Дата, "ДЛФ=DD"), СтрокаТаблицы.Отгрузка, СтрокаТаблицы.Автор);	
	 КонецЦикла;
	 
	 стрВозврата = стрВозврата + "</table>";
	 
	 стрВозврата = стрВозврата + омHTML.ПолучитьХвостHTML();
	 
	 Возврат стрВозврата;
 
КонецФункции // ПолучитьОтчетПоЧастичнойОтгрузкеHTNL()

Функция ПолучитьЧастичныеОтгрузки(ИзделиеКомплект)
 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.ПредметОтгрузки КАК Отгрузка,
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.Ссылка.Автор КАК Автор,
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.Ссылка.Дата КАК Дата
		|ИЗ
		|	Справочник.ЧастичнаяОтгрузка.ПредметыОтгрузки КАК ЧастичнаяОтгрузкаПредметыОтгрузки
		|ГДЕ
		|	ЧастичнаяОтгрузкаПредметыОтгрузки.Ссылка.ИзделиеКомплект = &ИзделиеКомплект
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата,
		|	ПредметОтгрузки";
	
	Запрос.УстановитьПараметр("ИзделиеКомплект", ИзделиеКомплект);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьЧастичныеОтгрузки()
